In [88]:
import pandas as pd

In [89]:
import numpy as np

In [3]:
s=pd.Series([1,2,3,4]) #1d row or coloumn

In [4]:
s

0    1
1    2
2    3
3    4
dtype: int64

In [5]:
type(s)

pandas.core.series.Series

In [6]:
s[1]

np.int64(2)

In [7]:
#data frame
x={
    "name":["mai","ali","omar"],
    "age":[20,25,30],
    "course":["Ai","os","ui"]
}

In [8]:
pd.DataFrame({
    "name":["mai","ali","omar"],
    "age":[20,25,30],
    "course":["Ai","os","UI"]
})

   name  age course
0   mai   20     Ai
1   ali   25     os
2  omar   30     UI

In [9]:
df=pd.DataFrame(x,index=["a","b","c"])

In [10]:
df

   name  age course
a   mai   20     Ai
b   ali   25     os
c  omar   30     ui

In [11]:
df=pd.DataFrame(x,columns=["name","age"])
df

   name  age
0   mai   20
1   ali   25
2  omar   30

In [12]:
arr=np.random.randint(1,10,(3,3))

In [13]:
arr

array([[8, 1, 9],
       [6, 3, 5],
       [7, 5, 1]], dtype=int32)

In [14]:
df=pd.DataFrame(arr)
df

   0  1  2
0  8  1  9
1  6  3  5
2  7  5  1

In [15]:
df=pd.DataFrame(arr,index=["a","b","c"])
df

   0  1  2
a  8  1  9
b  6  3  5
c  7  5  1

In [16]:
df=pd.DataFrame(arr,columns=["a","b","c"])
df

   a  b  c
0  8  1  9
1  6  3  5
2  7  5  1

In [17]:
df.a

0    8
1    6
2    7
Name: a, dtype: int32

In [18]:
df.get(["a","b"])

   a  b
0  8  1
1  6  3
2  7  5

In [19]:
df=pd.DataFrame({
    "name":["mai","ali","omar"],
    "age":[20,25,30],
    "course":["Ai","os","UI"]
})

In [20]:
df

   name  age course
0   mai   20     Ai
1   ali   25     os
2  omar   30     UI

In [21]:
df.get(["name"])

   name
0   mai
1   ali
2  omar

In [22]:
df.iloc[0]

name      mai
age        20
course     Ai
Name: 0, dtype: object

In [23]:
df.loc[0]

name      mai
age        20
course     Ai
Name: 0, dtype: object

In [24]:
df.iloc[0:2]

  name  age course
0  mai   20     Ai
1  ali   25     os

In [25]:
df.loc[0:2]

   name  age course
0   mai   20     Ai
1   ali   25     os
2  omar   30     UI

In [26]:
df["age"]>20

0    False
1     True
2     True
Name: age, dtype: bool

In [27]:
df[df["age"]>20]

   name  age course
1   ali   25     os
2  omar   30     UI

In [28]:
df[(df["age"]>20) & (df["name"]=="ali")]

  name  age course
1  ali   25     os

In [29]:
df

   name  age course
0   mai   20     Ai
1   ali   25     os
2  omar   30     UI

In [30]:
df.rename({"name":"fname"},axis=1,inplace=True)

In [31]:
df #copy

  fname  age course
0   mai   20     Ai
1   ali   25     os
2  omar   30     UI

In [32]:
df.rename

<bound method DataFrame.rename of   fname  age course
0   mai   20     Ai
1   ali   25     os
2  omar   30     UI>

In [33]:
df

  fname  age course
0   mai   20     Ai
1   ali   25     os
2  omar   30     UI

In [34]:
df.rename({"name":"fname"},axis=1)

  fname  age course
0   mai   20     Ai
1   ali   25     os
2  omar   30     UI

In [35]:
df

  fname  age course
0   mai   20     Ai
1   ali   25     os
2  omar   30     UI

In [36]:
df.rename({"name":"fname"},axis=1,inplace=True)

In [37]:
df

  fname  age course
0   mai   20     Ai
1   ali   25     os
2  omar   30     UI

In [38]:
df["gender"]=["f","m","m"]

In [39]:
df

  fname  age course gender
0   mai   20     Ai      f
1   ali   25     os      m
2  omar   30     UI      m

In [40]:
df.update({"gender":["f","m","m"]})

In [41]:
df

  fname  age course gender
0   mai   20     Ai      f
1   ali   25     os      m
2  omar   30     UI      m

In [42]:
df.drop(columns=["gender"],inplace=True)#oor axis=1

In [43]:
df

  fname  age course
0   mai   20     Ai
1   ali   25     os
2  omar   30     UI

In [44]:
df.drop(index=[0])

  fname  age course
1   ali   25     os
2  omar   30     UI

In [45]:
df.drop([0],axis=0)

  fname  age course
1   ali   25     os
2  omar   30     UI

In [46]:
df1=pd.DataFrame({
    "name":["mai","ali","omar"],
    "age":[20,25,30],
    "course":["Ai","os","UI"]
})
df2=pd.DataFrame({
    "name":["mai","ali","maro"],
    "sage":[20,25,30],
    "course":["Ai","os","UI"]
})

In [47]:
pd.concat([df1,df2])

   name   age course  sage
0   mai  20.0     Ai   NaN
1   ali  25.0     os   NaN
2  omar  30.0     UI   NaN
0   mai   NaN     Ai  20.0
1   ali   NaN     os  25.0
2  maro   NaN     UI  30.0

In [48]:
x=pd.concat([df1,df2],ignore_index=True)

In [49]:
x

   name   age course  sage
0   mai  20.0     Ai   NaN
1   ali  25.0     os   NaN
2  omar  30.0     UI   NaN
3   mai   NaN     Ai  20.0
4   ali   NaN     os  25.0
5  maro   NaN     UI  30.0

In [50]:
x.reset_index(inplace=True)

In [51]:
x

   index  name   age course  sage
0      0   mai  20.0     Ai   NaN
1      1   ali  25.0     os   NaN
2      2  omar  30.0     UI   NaN
3      3   mai   NaN     Ai  20.0
4      4   ali   NaN     os  25.0
5      5  maro   NaN     UI  30.0

In [52]:
x.drop(columns=["index"],inplace=True)

In [53]:
x

   name   age course  sage
0   mai  20.0     Ai   NaN
1   ali  25.0     os   NaN
2  omar  30.0     UI   NaN
3   mai   NaN     Ai  20.0
4   ali   NaN     os  25.0
5  maro   NaN     UI  30.0

In [54]:
df1=pd.DataFrame({
    "name":["mai","ali","omar"],
    "age":[20,25,30],
    "course":["Ai","os","UI"]
})
df2=pd.DataFrame({
    "name":["mai","ali","maro"],
    "sage":[20,25,30],
    "course":["Ai","os","UI"]
})

In [55]:
j=pd.merge(df1,df2,on="name")
j

  name  age course_x  sage course_y
0  mai   20       Ai    20       Ai
1  ali   25       os    25       os

In [56]:
j=pd.merge(df1,df2,on="name",how="left")
j

   name  age course_x  sage course_y
0   mai   20       Ai  20.0       Ai
1   ali   25       os  25.0       os
2  omar   30       UI   NaN      NaN

In [57]:
j=pd.merge(df1,df2,on="name",how="right")
j

   name   age course_x  sage course_y
0   mai  20.0       Ai    20       Ai
1   ali  25.0       os    25       os
2  maro   NaN      NaN    30       UI

In [58]:
d=pd.DataFrame({
    "name":["mai","ali","omar"],
    "age":[20,25,30],
    "course":["Ai","os","UI"]
})

In [59]:
#sort
d.sort_values(by="age")

   name  age course
0   mai   20     Ai
1   ali   25     os
2  omar   30     UI

In [60]:
d.sort_index()

   name  age course
0   mai   20     Ai
1   ali   25     os
2  omar   30     UI

In [61]:
d.sample(n=3)

   name  age course
0   mai   20     Ai
1   ali   25     os
2  omar   30     UI

In [62]:
d.sample(frac=0.5)

  name  age course
0  mai   20     Ai
1  ali   25     os

In [63]:
d["name"].replace({"Os":"Cs"})

0     mai
1     ali
2    omar
Name: name, dtype: object

In [64]:
d.shape

(3, 3)

In [65]:
len(d)

3

In [66]:
df = pd.DataFrame({
    'Name' : ['Aya', 'Ahmed', 'Omar', 'Alic', 'bob'],
    'Age' : [25, 24, 22, 26, 20],
    'Salary' : [10000, 20000, 34000, 50000, 45000],
    'Gender' : ['F', 'M', 'M', 'F', 'M'],
    'Annual_Income' : [120000, 300000, 1000000, 450000, 700000]
})

In [67]:
df

    Name  Age  Salary Gender  Annual_Income
0    Aya   25   10000      F         120000
1  Ahmed   24   20000      M         300000
2   Omar   22   34000      M        1000000
3   Alic   26   50000      F         450000
4    bob   20   45000      M         700000

In [68]:
df["bouns"]=[10,20,30,40,50]

In [69]:
df

    Name  Age  Salary Gender  Annual_Income  bouns
0    Aya   25   10000      F         120000     10
1  Ahmed   24   20000      M         300000     20
2   Omar   22   34000      M        1000000     30
3   Alic   26   50000      F         450000     40
4    bob   20   45000      M         700000     50

In [70]:
df.rename({"Salary":"Income"},axis=1,inplace=True)

In [71]:
df

    Name  Age  Income Gender  Annual_Income  bouns
0    Aya   25   10000      F         120000     10
1  Ahmed   24   20000      M         300000     20
2   Omar   22   34000      M        1000000     30
3   Alic   26   50000      F         450000     40
4    bob   20   45000      M         700000     50

In [72]:
df["Gender"]=df["Gender"].replace({"M":"male","F":"female"})

In [73]:
df

    Name  Age  Income  Gender  Annual_Income  bouns
0    Aya   25   10000  female         120000     10
1  Ahmed   24   20000    male         300000     20
2   Omar   22   34000    male        1000000     30
3   Alic   26   50000  female         450000     40
4    bob   20   45000    male         700000     50

In [74]:
df=df.sort_values(by="Income")

In [75]:
df

    Name  Age  Income  Gender  Annual_Income  bouns
0    Aya   25   10000  female         120000     10
1  Ahmed   24   20000    male         300000     20
2   Omar   22   34000    male        1000000     30
4    bob   20   45000    male         700000     50
3   Alic   26   50000  female         450000     40

In [76]:
#grouping and aggregration
df.groupby("Gender")["Income"].mean()

Gender
female    30000.0
male      33000.0
Name: Income, dtype: float64

In [77]:
df.groupby("Gender")["Age"].mean()

Gender
female    25.5
male      22.0
Name: Age, dtype: float64

In [78]:
df.groupby("Gender").agg({"Income":"mean","Age":"mean"})

         Income   Age
Gender
female  30000.0  25.5
male    33000.0  22.0

In [79]:
df

    Name  Age  Income  Gender  Annual_Income  bouns
0    Aya   25   10000  female         120000     10
1  Ahmed   24   20000    male         300000     20
2   Omar   22   34000    male        1000000     30
4    bob   20   45000    male         700000     50
3   Alic   26   50000  female         450000     40

In [80]:
df["bouns"]=df["bouns"]+1000

In [81]:
lm=lambda x:x+1000

In [82]:
df["bouns"]=df["bouns"].apply(lm)

In [83]:
df

    Name  Age  Income  Gender  Annual_Income  bouns
0    Aya   25   10000  female         120000   2010
1  Ahmed   24   20000    male         300000   2020
2   Omar   22   34000    male        1000000   2030
4    bob   20   45000    male         700000   2050
3   Alic   26   50000  female         450000   2040

In [84]:
dff=df.drop(columns=["Name","Gender"])
dff

   Age  Income  Annual_Income  bouns
0   25   10000         120000   2010
1   24   20000         300000   2020
2   22   34000        1000000   2030
4   20   45000         700000   2050
3   26   50000         450000   2040

In [85]:
dff.df

AttributeError: 'DataFrame' object has no attribute 'df'

In [ ]:
import pandas as pd

In [ ]:
pd.read_csv("D:")

In [ ]:
df = pd.DataFrame({
    'Name' : ['Aya', 'Ahmed', 'Omar', 'Alic', 'bob'],
    'Age' : [25, 24, 22, 26, 20],
    'Salary' : [10000, 20000, 34000, 50000, 45000],
    'Gender' : ['F', 'M', 'M', 'F', 'M'],
    'Annual_Income' : [120000, 300000, 1000000, 450000, 700000]
})

In [ ]:
x=pd.DataFrame({
    "name":["omar","ali"],
    "age":[19,12],
    "course":["ai","ui"]
})

   name  age course
0  omar   19     ai
1   ali   12     ui

In [93]:
x.loc[1,"course"]

'os'

In [ ]:
x.rename("")

In [94]:
df = pd.DataFrame({                       # Create DataFrame with multiple columns
    'Name': ['Aya', 'Ahmed', 'Omar', 'Alic', 'Bob'],
    'Age': [25, 24, 22, 26, 20],
    'Salary': [10000, 20000, 34000, 50000, 45000],
    'Gender': ['F', 'M', 'M', 'F', 'M'],
    'Annual_Income': [120000, 300000, 1000000, 450000, 700000]
})

In [96]:
df["bonus"]=np.random.randint(1000,5000)

In [97]:
df

    Name  Age  Salary Gender  Annual_Income  bonus
0    Aya   25   10000      F         120000   1282
1  Ahmed   24   20000      M         300000   1282
2   Omar   22   34000      M        1000000   1282
3   Alic   26   50000      F         450000   1282
4    Bob   20   45000      M         700000   1282

In [98]:
df.groupby("Gender").agg({"Annual_Income":"mean","Salary":"mean"})

        Annual_Income   Salary
Gender
F       285000.000000  30000.0
M       666666.666667  33000.0

In [101]:
data =pd.DataFrame({
    "Movie": ["Inception", "Titanic", "Avatar", "La La Land", "Joker"],
    "Genre": ["Sci-Fi", "Romance", "Sci-Fi", "Musical", "Thriller"],
    "Rating": [8.8, 7.9, 7.8, 8.2, 8.6],
    "Votes": [2000, 2500, 1800, 1500, 2200]
})

In [104]:
data.loc[0:2]

       Movie    Genre  Rating  Votes
0  Inception   Sci-Fi     8.8   2000
1    Titanic  Romance     7.9   2500
2     Avatar   Sci-Fi     7.8   1800

In [105]:
data.groupby("Genre").agg({
        "Rating":"median"
    })

          Rating
Genre
Musical      8.2
Romance      7.9
Sci-Fi       8.3
Thriller     8.6

In [106]:
data["Votes"].max()

np.int64(2500)

In [107]:
data["Weighted_Score"]=data["Rating"]*data["Votes"]

In [109]:
data

        Movie     Genre  Rating  Votes  Weighted_Score
0   Inception    Sci-Fi     8.8   2000         17600.0
1     Titanic   Romance     7.9   2500         19750.0
2      Avatar    Sci-Fi     7.8   1800         14040.0
3  La La Land   Musical     8.2   1500         12300.0
4       Joker  Thriller     8.6   2200         18920.0

In [110]:
data.sort_values(by="Weighted_Score")

        Movie     Genre  Rating  Votes  Weighted_Score
3  La La Land   Musical     8.2   1500         12300.0
2      Avatar    Sci-Fi     7.8   1800         14040.0
0   Inception    Sci-Fi     8.8   2000         17600.0
4       Joker  Thriller     8.6   2200         18920.0
1     Titanic   Romance     7.9   2500         19750.0

In [111]:
data.to_csv("data.csv")

In [112]:
data.read_csv("data.csv")

AttributeError: 'DataFrame' object has no attribute 'read_csv'

1. Merge **movies** and **ratings** on `MovieID`.
2. Create a new column `Rating_Label` using `.apply()`:

   * "Excellent" if Rating  9
   * "Good" if 7  Rating < 9
   * "Poor" if Rating < 7
3. Create a new column `Decade` (e.g. 2010  "2010s") using `.apply()`.
4. Find the **longest movie title** using `.apply(len)`.
5. Using `.apply()`, calculate `Rating_Adjusted` where each rating is **+0.5 if Thriller, else unchanged**.
6. For each movie, calculate the **average rating** using `groupby` + `.apply()` instead of `.mean()`.
7. For each user, calculate how many "Excellent" ratings they gave using `.apply()`.

In [114]:
movies = pd.DataFrame({
    "MovieID": [1, 2, 3, 4, 5, 6, 7],
    "Title": ["Inception", "Titanic", "Avatar", "La La Land", "Joker", "Avengers", "The Batman"],
    "Genre": ["Sci-Fi", "Romance", "Sci-Fi", "Musical", "Thriller", "Action", "Thriller"],
    "Year": [2010, 1997, 2009, 2016, 2019, 2012, 2022]
})

ratings = pd.DataFrame({
    "MovieID": [1, 1, 2, 2, 3, 4, 4, 5, 6, 6, 7, 7],
    "UserID": [101, 102, 101, 103, 102, 101, 104, 105, 101, 103, 102, 105],
    "Rating": [9, 8, 8, 7, 9, 8, 9, 7, 9, 8, 8, 9]
})

In [115]:
x=pd.merge(movies,ratings,on="MovieID")

In [116]:
x

    MovieID       Title     Genre  Year  UserID  Rating
0         1   Inception    Sci-Fi  2010     101       9
1         1   Inception    Sci-Fi  2010     102       8
2         2     Titanic   Romance  1997     101       8
3         2     Titanic   Romance  1997     103       7
4         3      Avatar    Sci-Fi  2009     102       9
5         4  La La Land   Musical  2016     101       8
6         4  La La Land   Musical  2016     104       9
7         5       Joker  Thriller  2019     105       7
8         6    Avengers    Action  2012     101       9
9         6    Avengers    Action  2012     103       8
10        7  The Batman  Thriller  2022     102       8
11        7  The Batman  Thriller  2022     105       9

In [130]:
def z(r):
    if r>=9:
        return"excellent"
    elif r<9:
        return"Good"
    else:
        return"poor"

In [131]:
ratings["Rating_label"]=ratings["Rating"].apply(z)
ratings

    MovieID  UserID  Rating Rating_label
0         1     101       9    excellent
1         1     102       8         Good
2         2     101       8         Good
3         2     103       7         Good
4         3     102       9    excellent
5         4     101       8         Good
6         4     104       9    excellent
7         5     105       7         Good
8         6     101       9    excellent
9         6     103       8         Good
10        7     102       8         Good
11        7     105       9    excellent

In [ ]:
;